{"keras_version": "2.0.8", "class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"name": "masking_1", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 2, 14], "mask_value": -1}}, {"class_name": "LSTM", "config": {"trainable": true, "recurrent_constraint": null, "recurrent_dropout": 0.0, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "stateful": false, "implementation": 0, "dropout": 0.2, "go_backwards": false, "use_bias": true, "name": "lstm_1", "unit_forget_bias": true, "units": 32, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "kernel_constraint": null, "dtype": "float32", "activation": "tanh", "bias_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 2, 14], "kernel_regularizer": null, "return_state": false}}, {"class_name": "Dense", "config": {"trainable": true, "units": 7, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "name": "dense_1", "bias_regularizer": null, "batch_input_shape": [null, 32], "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "backend": "tensorflow"}